–ò–º–ø–æ—Ä—Ç–∏—Ä—É–µ–º sqlite3

In [1]:
import sqlite3
import pandas as pd

–°–æ–∑–¥–∞–¥–∏–º –±–∞–∑—É –¥–∞–Ω–Ω—ã—Ö –ø—Ä—è–º–æ –≤ –ø–∞–º—è—Ç–∏ üò≤

In [3]:
path = ':memory:'
db = sqlite3.connect(path)
# –ü–æ–ª—É—á–∞–µ–º –∫—É—Ä—Å–æ—Ä –¥–ª—è —Ä–∞–±–æ—Ç—ã —Å –±–¥
cmd = db.cursor()

**–°—Ö–µ–º–∞ –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö**

![–°—Ö–µ–º–∞](../../markdown/output.svg)

**schema.sql**

``` SQL
DROP TABLE IF EXISTS sale_history;
DROP TABLE IF EXISTS sale_has_good;
DROP TABLE IF EXISTS category_has_good;
DROP TABLE IF EXISTS good;
DROP TABLE IF EXISTS client;
DROP TABLE IF EXISTS sale;
DROP TABLE IF EXISTS status;
DROP TABLE IF EXISTS source;
DROP TABLE IF EXISTS category;

CREATE TABLE status(
    name TEXT
);
INSERT INTO status
( name      ) VALUES
('–û—Ç–º–µ–Ω–µ–Ω'  ),
('–û–ø–ª–∞—á–µ–Ω'  ),
('–í –ø—É—Ç–∏'   ),
('–î–æ—Å—Ç–∞–≤–ª–µ–Ω'),
('–ü–æ–ª—É—á–µ–Ω–æ' );

CREATE TABLE source(
    name TEXT
);
INSERT INTO source
( name     ) VALUES
('–∏—Å—Ç–æ—á–Ω–∏–∫');


CREATE TABLE category(
    name TEXT
);
INSERT INTO category
( name       ) VALUES
('–µ–¥–∞'       ),
('–æ–¥–µ–∂–¥–∞'    ),
('–≥–∏–≥–∏–µ–Ω–∞'   ),
('—Ç–µ—Ö–Ω–∏–∫–∞'   ),
('–º–µ–±–µ–ª—å'    ),
('–∫–∞–Ω—Ü–µ–ª—è—Ä–∏—è'),
('–æ–±—É–≤—å'     ),
('–º–µ–¥–∏—Ü–∏–Ω–∞'  );


CREATE TABLE good(
    name  TEXT,
    price REAL
);
INSERT INTO good
( name              ,price) VALUES
('—à–æ–∫–æ–ª–∞–¥–∫–∞ –≤–∫—É—Å–Ω–∞—è',70    ),
('—à—Ç–∞–Ω—ã –∫–æ–∂–∞–Ω—ã–µ'    ,1000  ),
('–Ω–æ—É—Ç–±—É–∫ –∫—Ä—É—Ç–æ–π'   ,35000 ),
('–ª–∞–∫ —à–≤–µ—Ü–∫–∏–π'      ,350   ),
('–¥–∏–ø–ª–æ–º –≤—Ä–∞—á–∞'     ,2000  ),
('–∫–∞–ø–ª–∏ –≥–ª–∞–∑–Ω—ã–µ'    ,50    ),
('–Ω–∞—Å—Ç–æ–ª—å–Ω–∞—è –ª–∞–º–ø–∞' ,200   ),
('–º—ã—à–∫–∞ B7 Tech'    ,2700  ),
('—Ç–µ—Ç—Ä–∞–¥—ä'          ,150   ),
('–±–æ—Ç–∏–Ω–∫–∏ –∞–±–∏–±–∞—Å'   ,15000 );


CREATE TABLE client(
    code       TEXT,
    first_name TEXT,
    last_name  TEXT,
    source_id  INTEGER,
    FOREIGN KEY(source_id) REFERENCES source(id)
);
INSERT INTO client
( code, first_name, last_name    ,source_id  ) VALUES
('1'  ,'–î–∏–∞–Ω–∞'    ,'–ê–ª–µ–∫—Å–∞–Ω–¥—Ä–æ–≤–∞',1          ),
('2'  ,'–ï–≤–≥–µ–Ω–∏–π'  ,'–°–º–∏—Ä–Ω–æ–≤'     ,1          ),
('3'  ,'–ò–≥–æ—Ä—å'    ,'–ü–µ—Ç—Ä–æ–≤'      ,1          ),
('4'  ,'–í–∞–ª–µ–Ω—Ç–∏–Ω' ,'–ö—É—à–∫–æ–≤'      ,1          ),
('5'  ,'–Ø—Ä–æ—Å–ª–∞–≤'  ,'–í–æ–ª–∫–æ–≤'      ,1          );


CREATE TABLE sale(
    client_id   INTEGER,
    number      TEXT,
    dt_created  DATE,
    dt_modified DATE,
    sale_sum    REAL,
    status_id   INTEGER,
    FOREIGN KEY(client_id) REFERENCES client(id),
    FOREIGN KEY(status_id) REFERENCES status(id)
);
INSERT INTO sale
(client_id, number, dt_created , dt_modified,sale_sum,status_id) VALUES
(1        ,'000'  ,'2022-08-05','2022-08-05',94      ,2        ),
(2        ,'000'  ,'2022-08-13','2022-08-13',326     ,5        ),
(3        ,'000'  ,'2022-08-24','2022-08-24',92      ,1        ),
(4        ,'000'  ,'2022-08-01','2022-08-01',1996    ,4        ),
(5        ,'000'  ,'2022-08-04','2022-08-04',256     ,3        ),
(1        ,'000'  ,'2022-08-05','2022-08-05',941     ,5        ),
(2        ,'000'  ,'2022-08-13','2022-08-13',95      ,1        ),
(3        ,'000'  ,'2022-08-24','2022-08-24',936     ,4        ),
(4        ,'000'  ,'2022-08-01','2022-08-01',984     ,3        ),
(5        ,'000'  ,'2022-08-04','2022-08-04',821     ,2        );

CREATE TABLE sale_history(
    sale_id     INTEGER,
    status_id   INTEGER,
    sale_sum    REAL,
    active_from DATE,
    active_to   DATE,
    FOREIGN KEY(sale_id) REFERENCES sale(id),
    FOREIGN KEY(status_id) REFERENCES status(id)
);
INSERT INTO sale_history
(sale_id,status_id,sale_sum, active_from, active_to  ) VALUES
(1      ,2        ,94      ,'2022-08-05','2022-09-23'),
(2      ,5        ,326     ,'2022-08-13','2022-09-12'),
(3      ,1        ,92      ,'2022-08-24','2022-09-20'),
(4      ,4        ,1996    ,'2022-08-01','2022-09-15'),
(5      ,3        ,256     ,'2022-08-04','2022-09-26'),
(6      ,5        ,941     ,'2022-08-05','2022-09-23'),
(7      ,1        ,95      ,'2022-08-13','2022-09-12'),
(8      ,4        ,936     ,'2022-08-24','2022-09-20'),
(9      ,3        ,984     ,'2022-08-01','2022-09-15'),
(10     ,2        ,821     ,'2022-08-04','2022-09-26');

CREATE TABLE sale_has_good(
    sale_id INTEGER,
    good_id INTEGER,
    FOREIGN KEY(sale_id) REFERENCES sale(id),
    FOREIGN KEY(good_id) REFERENCES good(id)
);

CREATE TABLE category_has_good(
    category_id INTEGER,
    good_id     INTEGER,
    FOREIGN KEY(category_id) REFERENCES category(id),
    FOREIGN KEY(good_id) REFERENCES good(id)
);
INSERT INTO category_has_good
(good_id,category_id) VALUES
(1      ,1          ),
(2      ,2          ),
(3      ,4          ),
(4      ,3          ),
(6      ,8          ),
(7      ,5          ),
(8      ,4          ),
(9      ,6          ),
(10     ,7          ),
(10     ,2          );
```

In [4]:
cmd.executescript(open("schema.sql").read())

#### –ó–∞–¥–∞—á–∞ 3
–í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –ø–æ–∑–∏—Ü–∏–π —Å–ø–∏—Å–∫–∞ —Ç–æ–≤–∞—Ä–æ–≤ –ø—Ä–∏–Ω–∞–¥–ª–µ–∂–∞—â–∏–µ –∫–∞–∫–æ–π-–ª–∏–±–æ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Å –Ω–∞–∑–≤–∞–Ω–∏—è–º–∏ —Ç–æ–≤–∞—Ä–æ–≤ –∏ –Ω–∞–∑–≤–∞–Ω–∏—è–º–∏ –∫–∞—Ç–µ–≥–æ—Ä–∏–π. –°–ø–∏—Å–æ–∫ –¥–æ–ª–∂–µ–Ω –±—ã—Ç—å –æ—Ç—Å–æ—Ä—Ç–∏—Ä–æ–≤–∞–Ω –ø–æ –Ω–∞–∑–≤–∞–Ω–∏—é —Ç–æ–≤–∞—Ä–∞, –Ω–∞–∑–≤–∞–Ω–∏—é –∫–∞—Ç–µ–≥–æ—Ä–∏–∏. –î–ª—è —Å–æ–µ–¥–∏–Ω–µ–Ω–∏—è —Ç–∞–±–ª–∏—Ü –Ω–µ–æ–±—Ö–æ–¥–∏–º–æ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å –æ–ø–µ—Ä–∞—Ç–æ—Ä INNER JOIN. –û–∂–∏–¥–∞–µ–º—ã–π —Ñ–æ—Ä–º–∞—Ç —Ä–µ–∑—É–ª—å—Ç–∞—Ç–∞:

**query.sql**
``` SQL
SELECT good.name, category.name FROM good -- –≤—ã–±–∏—Ä–∞–µ–º –∏–º—è —Ç–æ–≤–∞—Ä–∞ –∏ –∏–º—è –∫–∞—Ç–µ–≥–æ—Ä–∏–∏
LEFT JOIN category_has_good
    ON good.rowid = category_has_good.good_id
LEFT JOIN category
    ON category.rowid = category_has_good.category_id
ORDER BY -- —Å–æ—Ä—Ç–∏—Ä—É–µ–º –ø–æ —Å—Ç–æ–ª–±—Ü–∞–º
    good.name ASC, 
    category.name ASC;
```

In [5]:
df = pd.read_sql_query(open('query.sql').read(), db)
display(df)

                 name        name
0      –±–æ—Ç–∏–Ω–∫–∏ –∞–±–∏–±–∞—Å       –æ–±—É–≤—å
1      –±–æ—Ç–∏–Ω–∫–∏ –∞–±–∏–±–∞—Å      –æ–¥–µ–∂–¥–∞
2        –¥–∏–ø–ª–æ–º –≤—Ä–∞—á–∞        None
3       –∫–∞–ø–ª–∏ –≥–ª–∞–∑–Ω—ã–µ    –º–µ–¥–∏—Ü–∏–Ω–∞
4         –ª–∞–∫ —à–≤–µ—Ü–∫–∏–π     –≥–∏–≥–∏–µ–Ω–∞
5       –º—ã—à–∫–∞ B7 Tech     —Ç–µ—Ö–Ω–∏–∫–∞
6    –Ω–∞—Å—Ç–æ–ª—å–Ω–∞—è –ª–∞–º–ø–∞      –º–µ–±–µ–ª—å
7      –Ω–æ—É—Ç–±—É–∫ –∫—Ä—É—Ç–æ–π     —Ç–µ—Ö–Ω–∏–∫–∞
8             —Ç–µ—Ç—Ä–∞–¥—ä  –∫–∞–Ω—Ü–µ–ª—è—Ä–∏—è
9   —à–æ–∫–æ–ª–∞–¥–∫–∞ –≤–∫—É—Å–Ω–∞—è         –µ–¥–∞
10      —à—Ç–∞–Ω—ã –∫–æ–∂–∞–Ω—ã–µ      –æ–¥–µ–∂–¥–∞

#### –ó–∞–¥–∞—á–∞ 4
–£–¥–∞–ª–∏—Ç–µ –∏–∑ —Ç–∞–±–ª–∏—Ü—ã `client` –ø–æ–ª—è `code` –∏ `source_id`.

**delete.sql**
> ``` SQL
> PRAGMA foreign_keys=off;
> BEGIN TRANSACTION;
> 
> ALTER TABLE client RENAME TO _client_old;
> 
> CREATE TABLE client
> (
>     first_name TEXT,
>     last_name  TEXT
> );
> 
> INSERT INTO client SELECT first_name, last_name FROM _client_old;
> DROP TABLE _client_old;
> 
> COMMIT;
> PRAGMA foreign_keys=on;
> ```

In [6]:
df = pd.read_sql_query('SELECT * FROM client', db)
print('–î–æ')
display(df)
cmd.executescript(open('delete.sql').read())
df = pd.read_sql_query('SELECT * FROM client', db)
print('–ü–æ—Å–ª–µ')
display(df)

–î–æ

  code first_name     last_name  source_id
0    1      –î–∏–∞–Ω–∞  –ê–ª–µ–∫—Å–∞–Ω–¥—Ä–æ–≤–∞          1
1    2    –ï–≤–≥–µ–Ω–∏–π       –°–º–∏—Ä–Ω–æ–≤          1
2    3      –ò–≥–æ—Ä—å        –ü–µ—Ç—Ä–æ–≤          1
3    4   –í–∞–ª–µ–Ω—Ç–∏–Ω        –ö—É—à–∫–æ–≤          1
4    5    –Ø—Ä–æ—Å–ª–∞–≤        –í–æ–ª–∫–æ–≤          1

–ü–æ—Å–ª–µ

  first_name     last_name
0      –î–∏–∞–Ω–∞  –ê–ª–µ–∫—Å–∞–Ω–¥—Ä–æ–≤–∞
1    –ï–≤–≥–µ–Ω–∏–π       –°–º–∏—Ä–Ω–æ–≤
2      –ò–≥–æ—Ä—å        –ü–µ—Ç—Ä–æ–≤
3   –í–∞–ª–µ–Ω—Ç–∏–Ω        –ö—É—à–∫–æ–≤
4    –Ø—Ä–æ—Å–ª–∞–≤        –í–æ–ª–∫–æ–≤